[NoCoverage] BlockStatement
contract-testing/Frontend/src/App.js:4:16
 import "./App.css";
 import Routes from "./Routes";
 
-function App() {
-  return (
-    <div className="App">
-      <Routes />
-    </div>
-  );
-}
+function App() {}
 
 export default App;
