[NoCoverage] BlockStatement
contract-testing/Frontend/src/AuthorizedRoute.js:4:31
 import { Outlet, Navigate } from "react-router-dom";
 import isAuth from "./utils/isAuth";
 
-const AuthorizedRoute = () => {
-  console.log("isAuth()", isAuth());
-  return isAuth() ? <Outlet /> : <Navigate to="/login" />;
-};
+const AuthorizedRoute = () => {};
 
 export default AuthorizedRoute;

[NoCoverage] StringLiteral
contract-testing/Frontend/src/AuthorizedRoute.js:5:15
 import isAuth from "./utils/isAuth";
 
 const AuthorizedRoute = () => {
-  console.log("isAuth()", isAuth());
+  console.log("", isAuth());
   return isAuth() ? <Outlet /> : <Navigate to="/login" />;
 };
