[NoCoverage] ArrowFunction
Frontend/src/pages/Login.js:7:25
 const Login = () => {
   const navigate = useNavigate();
 
-  const onChangeLogin = (e) =>
-    window.localStorage.setItem("login", e.target.value);
+  const onChangeLogin = () => undefined;
   const onChangePassword = (e) =>
     window.localStorage.setItem("password", e.target.value);

[NoCoverage] ArrowFunction
Frontend/src/pages/Login.js:9:28
 
   const onChangeLogin = (e) =>
     window.localStorage.setItem("login", e.target.value);
-  const onChangePassword = (e) =>
-    window.localStorage.setItem("password", e.target.value);
+  const onChangePassword = () => undefined;
 
   const onClickButton = () => {

[NoCoverage] StringLiteral
Frontend/src/pages/Login.js:10:33
   const onChangeLogin = (e) =>
     window.localStorage.setItem("login", e.target.value);
   const onChangePassword = (e) =>
-    window.localStorage.setItem("password", e.target.value);
+    window.localStorage.setItem("", e.target.value);
 
   const onClickButton = () => {

[NoCoverage] BlockStatement
Frontend/src/pages/Login.js:12:31
   const onChangePassword = (e) =>
     window.localStorage.setItem("password", e.target.value);
 
-  const onClickButton = () => {
-    const login = window.localStorage.getItem("login");
-    const password = window.localStorage.getItem("login");
-    if (login !== "" && password !== "") {
-      navigate("/");
-    }
-  };
+  const onClickButton = () => {};
 
   return (

[NoCoverage] StringLiteral
Frontend/src/pages/Login.js:13:47
     window.localStorage.setItem("password", e.target.value);
 
   const onClickButton = () => {
-    const login = window.localStorage.getItem("login");
+    const login = window.localStorage.getItem("");
     const password = window.localStorage.getItem("login");
     if (login !== "" && password !== "") {

[NoCoverage] ConditionalExpression
Frontend/src/pages/Login.js:15:9
   const onClickButton = () => {
     const login = window.localStorage.getItem("login");
     const password = window.localStorage.getItem("login");
-    if (login !== "" && password !== "") {
+    if (false) {
       navigate("/");
     }

[NoCoverage] ConditionalExpression
Frontend/src/pages/Login.js:15:25
   const onClickButton = () => {
     const login = window.localStorage.getItem("login");
     const password = window.localStorage.getItem("login");
-    if (login !== "" && password !== "") {
+    if (login !== "" && true) {
       navigate("/");
     }

[NoCoverage] StringLiteral
Frontend/src/pages/Login.js:16:16
     const login = window.localStorage.getItem("login");
     const password = window.localStorage.getItem("login");
     if (login !== "" && password !== "") {
-      navigate("/");
+      navigate("");
     }
   };
