[NoCoverage] BlockStatement
contract-testing/Frontend/src/Routes.js:7:31
 import Dashboard from "./pages/Dashboard";
 import Login from "./pages/Login";
 
-const RoutesComponent = () => {
-  return (
-    <Routes>
-      <Route exact path="/login" element={<Login />} />
-      <Route exact path="/" element={<AuthorizedRoute />}>
-        <Route exact path="/" element={<Dashboard />} />
-      </Route>
-    </Routes>
-  );
-};
+const RoutesComponent = () => {};
 
 export default RoutesComponent;
