[NoCoverage] BlockStatement
Frontend/src/utils/isAuth.js:3:22
 import { isEmpty } from "lodash";
 
-const isAuth = () => {
-  const login = window.localStorage.getItem("login");
-  const password = window.localStorage.getItem("password");
-  if (!isEmpty(login) && !isEmpty(password)) {
-    return true;
-  } else {
-    return false;
-  }
-};
+const isAuth = () => {};
 
 export default isAuth;

[NoCoverage] StringLiteral
Frontend/src/utils/isAuth.js:5:48
 
 const isAuth = () => {
   const login = window.localStorage.getItem("login");
-  const password = window.localStorage.getItem("password");
+  const password = window.localStorage.getItem("");
   if (!isEmpty(login) && !isEmpty(password)) {
     return true;

[NoCoverage] BooleanLiteral
Frontend/src/utils/isAuth.js:6:26
 const isAuth = () => {
   const login = window.localStorage.getItem("login");
   const password = window.localStorage.getItem("password");
-  if (!isEmpty(login) && !isEmpty(password)) {
+  if (!isEmpty(login) && isEmpty(password)) {
     return true;
   } else {

[NoCoverage] ConditionalExpression
Frontend/src/utils/isAuth.js:6:7
 const isAuth = () => {
   const login = window.localStorage.getItem("login");
   const password = window.localStorage.getItem("password");
-  if (!isEmpty(login) && !isEmpty(password)) {
+  if (false) {
     return true;
   } else {

[NoCoverage] BooleanLiteral
Frontend/src/utils/isAuth.js:7:12
   const login = window.localStorage.getItem("login");
   const password = window.localStorage.getItem("password");
   if (!isEmpty(login) && !isEmpty(password)) {
-    return true;
+    return false;
   } else {
     return false;
