[Killed] BlockStatement
Frontend/src/pages/Dashboard.js:3:25
 import { useState, useEffect } from "react";
 import axios from "axios";
-const Dashboard = () => {
-  const [users, setUsers] = useState([]);
-
-  useEffect(() => {
-    axios
-      .get("http://localhost:8080/users")
-      .then((res) => setUsers(res?.data))
-      .catch((err) => console.log("err", err));
-  }, []);
-  return (
-    <>
-      <h1>Lista uzytkowników</h1>
-      <h2>Dzialajace logowanie</h2>
-      <ol>
-        {users?.map((el, idx) => (
-          <li key={idx}>
-            <p>name: {el.name}</p>
-            <p>description: {el.description}</p>
-          </li>
-        ))}
-      </ol>
-    </>
-  );
-};
+const Dashboard = () => {};
 
 export default Dashboard;
killedBy: should render header
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Survived] BlockStatement
Frontend/src/pages/Dashboard.js:6:19
 const Dashboard = () => {
   const [users, setUsers] = useState([]);
 
-  useEffect(() => {
-    axios
-      .get("http://localhost:8080/users")
-      .then((res) => setUsers(res?.data))
-      .catch((err) => console.log("err", err));
-  }, []);
+  useEffect(() => {}, []);
   return (
     <>

[NoCoverage] OptionalChaining
Frontend/src/pages/Dashboard.js:9:31
   useEffect(() => {
     axios
       .get("http://localhost:8080/users")
-      .then((res) => setUsers(res?.data))
+      .then((res) => setUsers(res.data))
       .catch((err) => console.log("err", err));
   }, []);

[Survived] ArrowFunction
Frontend/src/pages/Dashboard.js:9:13
   useEffect(() => {
     axios
       .get("http://localhost:8080/users")
-      .then((res) => setUsers(res?.data))
+      .then(() => undefined)
       .catch((err) => console.log("err", err));
   }, []);

[Survived] ArrowFunction
Frontend/src/pages/Dashboard.js:10:14
     axios
       .get("http://localhost:8080/users")
       .then((res) => setUsers(res?.data))
-      .catch((err) => console.log("err", err));
+      .catch(() => undefined);
   }, []);
   return (

[NoCoverage] StringLiteral
Frontend/src/pages/Dashboard.js:10:35
     axios
       .get("http://localhost:8080/users")
       .then((res) => setUsers(res?.data))
-      .catch((err) => console.log("err", err));
+      .catch((err) => console.log("", err));
   }, []);
   return (

[Survived] ArrayDeclaration
Frontend/src/pages/Dashboard.js:11:6
       .get("http://localhost:8080/users")
       .then((res) => setUsers(res?.data))
       .catch((err) => console.log("err", err));
-  }, []);
+  }, ["Stryker was here"]);
   return (
     <>

[Survived] ArrowFunction
Frontend/src/pages/Dashboard.js:17:21
       <h1>Lista uzytkowników</h1>
       <h2>Dzialajace logowanie</h2>
       <ol>
-        {users?.map((el, idx) => (
-          <li key={idx}>
-            <p>name: {el.name}</p>
-            <p>description: {el.description}</p>
-          </li>
-        ))}
+        {users?.map(() => undefined)}
       </ol>
     </>

[Survived] OptionalChaining
Frontend/src/pages/Dashboard.js:17:10
       <h1>Lista uzytkowników</h1>
       <h2>Dzialajace logowanie</h2>
       <ol>
-        {users?.map((el, idx) => (
+        {users.map((el, idx) => (
           <li key={idx}>
             <p>name: {el.name}</p>
